Revit 2027 API
BuiltInFailures.ImportFailures.CannotChangeImportSymbol Property
 Can't change an imported or linked element's symbol type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeImportSymbol { get; }
Public Shared ReadOnly Property CannotChangeImportSymbol As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeImportSymbol {
	FailureDefinitionId^ get ();
}
static member CannotChangeImportSymbol : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace